"""
1. 스택
    - 데이터를 저장하는 선형(저장되는 순서규칙) 자료구조
    -후입선출 ( 나중에 들어온 값이 먼저 나간다)
    - 형태 : 입구와 출구가 하나로 존재한다
    -장점 : 데이터 추가와 제거가 매우 간단하고 빠르다
    -용어 :
        1. psuh : 스텍구조에 데이터를 추가 하는 연산 용어, 새로운 데이터는 항상 스택 구조의 맨위 에 위치한다
        2. pop: 스택구조에 데이터를 제거 하고 반환하는 용산 용어, 가장 최근에 추가된 데이터를 제거
        3. peek : 스택구조의 맨 위에 있는 데이터를 반환 연산 용어, 제거는 하지 않는다. 스택구조의 최상위 확인용도 이다.
2. 큐
    - 데이터를 저장하는 선형 자료구조
    - 선입선출 (먼저 들어온 값이 먼저 나간다)
    - 형태 : 입구와 출구가 별도로 각 존재한다.
    - 장점 : 입력한 순서대로 저장한다. 단순
    - 용어:
        1. enqueue : 큐에 데이터를 추가하는 연산 용어
        2. dequeue : 큐에 데이터를 제거하고 반환하는 연산 용어
        3. peek : 큐에 맨 앞에 있는 데이터를 반환 연산 용어, 제거는 하지 않는다. 큐 구조의 확인 용도이다.
"""

